module.exports={
    "终端漏洞查补": "终端漏洞查补",
    "漏洞库和补丁包升级": "漏洞库和补丁包升级",
  
    "接口设置": "接口设置",
  
    "路由设置": "路由设置",
  
    "系统工具": "系统工具",
  
    "风险报告": "风险报告",
  
    "上次扫描时间": "上次扫描时间",
  
    "暂无记录": "暂无记录",
  
    "添加漏洞扫描任务": "添加漏洞扫描任务",
  
    "全部高危漏洞": "全部高危漏洞",
  
    "全部漏洞": "全部漏洞",
  
    "漏洞扫描": "漏洞扫描",
  
    "添加成功": "添加成功",
  
    "服务器异常": "服务器异常",
  
    "扫描中...": "扫描中...",
  
    "扫描已完成": "扫描已完成",
  
    "扫描已取消": "扫描已取消",
  
    "数据获取失败": "数据获取失败",
  
    "定时任务": "定时任务",
  
    "手动任务": "手动任务",
  
    "暂无漏洞扫描任务": "暂无漏洞扫描任务",
  
    "请点击“添加漏洞扫描任务”进行配置": "请点击“添加漏洞扫描任务”进行配置",
  
    "扫描状态": "扫描状态",
  
    "未修复漏洞": "未修复漏洞",
  
    "处置漏洞": "处置漏洞",
  
    "选择终端": "选择终端",
  
    "选择漏洞": "选择漏洞",
  
    "高危漏洞": "高危漏洞",
  
    "自定义选择": "自定义选择",
  
    "自定义选择 >": "自定义选择 >",
  
    "当前终端状态无法进行操作": "当前终端状态无法进行操作",
  
    "选择扫描漏洞": "选择扫描漏洞",
  
    "自定义选择（已选{0}个漏洞） >": "自定义选择（已选{0}个漏洞） >",
  
    "请选择时间段": "请选择时间段",
  
    "补丁编号 / 补丁名称": "补丁编号 / 补丁名称",
  
    "漏洞级别": "漏洞级别",
  
    "补丁名称": "补丁名称",
  
    "补丁编号": "补丁编号",
  
    "补丁影响": "补丁影响",
  
    "补丁发布日期": "补丁发布日期",
  
    "取消勾选": "取消勾选",
  
    "修复": "修复",
  
    "取消忽略": "取消忽略",
  
    "补丁类型": "补丁类型",
  
    "修复状态": "修复状态",
  
    "补丁编号：": "补丁编号：",
  
    "补丁名称：": "补丁名称：",
  
    "补丁描述：": "补丁描述：",
  
    "补丁类型：": "补丁类型：",
  
    "补丁发布日期：": "补丁发布日期：",
  
    "补丁包下载：": "补丁包下载：",
  
    "重启生效": "重启生效",
  
    "高危": "高危",
  
    "中危": "中危",
  
    "低危": "低危",
  
    "漏洞详情": "漏洞详情",
  
    "未开始": "未开始",
  
    "扫描中": "扫描中",
  
    "已终止": "已终止",
  
    "已完成": "已完成",
  
    "已取消": "已取消",
    "AF和AC平台的接入仅需在其平台输入EDR管理平台的IP即可完成对接": "AF和AC平台的接入仅需在其平台输入EDR管理平台的IP即可完成对接",
  
    "如何接入？": "如何接入？",
  
    "设备地址": "设备地址",
  
    "请输入设备地址": "请输入设备地址",
  
    "密码最大长度是90个字节，不支持汉字，只能由字母、数字以及 @{}[]()｛｝-_+|.? 符号组成": "密码最大长度是90个字节，不支持汉字，只能由字母、数字以及 @{}[]()｛｝-_+|.? 符号组成",
  
    "当前版本SOC、X-Central两个平台只能接入其中一个，若需要接入其他平台请先删除已接入的此类平台": "当前版本SOC、X-Central两个平台只能接入其中一个，若需要接入其他平台请先删除已接入的此类平台",
  
    "1、密码不包含用户名": "1、密码不包含用户名",
  
    "2、密码长度为8~32位，不支持中文、空格和全角字符": "2、密码长度为8~32位，不支持中文、空格和全角字符",
  
    "3、必须同时包含字母、数字和特殊字符之中两种": "3、必须同时包含字母、数字和特殊字符之中两种",
  
    "接入BBC支持的格式包括IP和域名，如下：": "接入BBC支持的格式包括IP和域名，如下：",
  
    "1.IP:PORT, 例如：3.3.3.3:5000": "1.IP:PORT, 例如：3.3.3.3:5000",
  
    "2.域名, 例如：www.sangfor.com": "2.域名, 例如：www.sangfor.com",
  
    "3.域名:PORT, 例如：www.sangfor.com:5000": "3.域名:PORT, 例如：www.sangfor.com:5000",
  
    "企业ID支持8-10位，且第一位数字非0": "企业ID支持8-10位，且第一位数字非0",
  
    "AF": "AF",
  
    "X-Central": "X-Central",
  
    "X-central": "X-central",
  
    "BBC": "BBC",
  
    "联动查杀": "联动查杀",
  
    "僵尸网络举证": "僵尸网络举证",
  
    "安全专家取证": "安全专家取证",
  
    "联动文件处置": "联动文件处置",
  
    "联动网络阻断": "联动网络阻断",
  
    "联动日志上报": "联动日志上报",
  
    "上网行为管理（AC）": "上网行为管理（AC）",
  
    "下一代防火墙（AF）": "下一代防火墙（AF）",
  
    "安全感知平台（SIP3.0.14）": "安全感知平台（SIP3.0.14）",
  
    "深信服云图（X-Central）": "深信服云图（X-Central）",
  
    "集中式管理平台（BBC）": "集中式管理平台（BBC）",
  
    "接入联动设备": "接入联动设备",
  
    "联动设备名称": "联动设备名称",
  
    "联动设备类型": "联动设备类型",
  
    "联动设备IP": "联动设备IP",
  
    "联动设备版本号": "联动设备版本号",
  
    "日志传输": "日志传输",
  
    "已开启": "已开启",
  
    "未开启": "未开启",
  
    "不支持传输": "不支持传输",
  
    "接入时间": "接入时间",
  
    "解除联动": "解除联动",
  
    "网端云安全防护体系了解": "网端云安全防护体系了解",
  
    "如何接入": "如何接入",
  
    "联动管理": "联动管理",
  
    "确定解除和${CONST.FULL_TEXT_MAP[item.type]} ${ip}的联动吗？": "确定解除和${CONST.FULL_TEXT_MAP[item.type]} ${ip}的联动吗？",
  
    "确定解除和${CONST.FULL_TEXT_MAP[item.type]} ${ip}的联动吗？\r\n            <br/><span style='color: #999'>解除后，平台联动下发的网络阻隔策略将被删除</span>": "确定解除和${CONST.FULL_TEXT_MAP[item.type]} ${ip}的联动吗？\r\n            <br/><span style='color: #999'>解除后，平台联动下发的网络阻隔策略将被删除</span>",
  
    "连接服务器失败，请检查网络连通性以及配置信息是否正确": "连接服务器失败，请检查网络连通性以及配置信息是否正确",
    "正在处理，命令下发中...": "正在处理，命令下发中...",
  
    "操作下发成功": "操作下发成功",
  
    "操作下发超时": "操作下发超时",
  
    "放行成功": "放行成功",
  
    "放行失败": "放行失败",
  
    "阻断成功": "阻断成功",
  
    "阻断失败": "阻断失败",
  
    "其他原因失败": "其他原因失败",
  
    "高级威胁": "高级威胁",
  
    "已处置终端": "已处置终端",
  
    "全部威胁终端": "全部威胁终端",
  
    "处置成功": "处置成功",
  
    "处置失败": "处置失败",
  
    "部分待处理": "部分待处理",
  
    "【深信服自适应深度检测引擎】检测鉴定此文件100%为病毒事件，建议对其进行处置 ": "【深信服自适应深度检测引擎】检测鉴定此文件100%为病毒事件，建议对其进行处置 ",
  
    "深度鉴定": "深度鉴定",
  
    "一键处置针对木马等恶意程序，将对文件进行删除；针对感染性病毒，将进行修复来清除感染；": "一键处置针对木马等恶意程序，将对文件进行删除；针对感染性病毒，将进行修复来清除感染；",
  
    "一键信任针对进程等文件将加入信任区；针对Powershell无文件攻击的进程将进行放行": "一键信任针对进程等文件将加入信任区；针对Powershell无文件攻击的进程将进行放行",

    "隔离时长（天）": "隔离时长（天）",
  
    "EDR管理员{0}": "EDR管理员{0}",
  
    "确定解除隔离终端{0}({1})？": "确定解除隔离终端{0}({1})？",
  
    "确定解除已隔离的{0}台终端吗？": "确定解除已隔离的{0}台终端吗？",
  
    "解除成功": "解除成功",
  
    "解除中": "解除中",
  
    "可疑无文件攻击": "可疑无文件攻击",
  
    "powershell脚本执行": "powershell脚本执行",
  
    "实时防护": "实时防护",
  
    "平台手动查杀": "平台手动查杀",
  
    "平台定时查杀": "平台定时查杀",
  
    "AF联动": "AF联动",
  
    "AC联动": "AC联动",
  
    "SIP联动": "SIP联动",
  
    "SOC联动": "SOC联动",
  
    "high": "high",
  
    "middle": "middle",
  
    "low": "low",
  
    "发现方式:": "发现方式:",
  
    "未知方法": "未知方法",
  
    "威胁信息": "威胁信息",
  
    "威胁类型:": "威胁类型:",
  
    "执行方式: ": "执行方式: ",
  
    "受影响的终端和进程信息": "受影响的终端和进程信息",
  
    "影响终端:": "影响终端:",
  
    ",": ",",
  
    "威胁进程:": "威胁进程:",
  
    "运行参数: ": "运行参数: ",
  
    "检测信息": "检测信息",
  
    "发现方式: ": "发现方式: ",
  
    "发现时间: ": "发现时间: ",
  
    "处置建议": "处置建议",
  
    "检测引擎: ": "检测引擎: ",
  
    "文件大小: ": "文件大小: ",
  
    "文件创建时间: ": "文件创建时间: ",
  
    "开始封堵时间": "开始封堵时间",
  
    "已加入黑名单": "已加入黑名单",
  
    "{0}分钟": "{0}分钟",
  
    "终端名称/ip/域名地址": "终端名称/ip/域名地址",
  
    "恶意地址": "恶意地址",
  
    "访问该地址的终端": "访问该地址的终端",
  
    "访问该地址的进程": "访问该地址的进程",
  
    "累计访问次数": "累计访问次数",
  
    "进程关联文件总数": "进程关联文件总数",
  
    "未处理文件数": "未处理文件数",
  
    "已处置文件数": "已处置文件数",
  
    "已信任文件数": "已信任文件数",
  
    "持续观察": "持续观察",
  
    "已处置": "已处置",
  
    "确定一键移出已选的{0}个终端的{1}个已信任文件吗？": "确定一键移出已选的{0}个终端的{1}个已信任文件吗？",
  
    "确定{0}已选的{1}个终端的全部进程及其关联文件吗？": "确定{0}已选的{1}个终端的全部进程及其关联文件吗？",
  
    "确定移出终端{0}的{1}个已信任文件吗？": "确定移出终端{0}的{1}个已信任文件吗？",
  
    "确定{0}终端{1}的全部进程及其关联文件吗？": "确定{0}终端{1}的全部进程及其关联文件吗？",
  
    "威胁进程": "威胁进程",
  
    "运行参数": "运行参数",
  
    "利用非常规的、传统安全软件不易或无法检测的攻击手段，对主机进行病毒传播和恶意破坏威胁。": "利用非常规的、传统安全软件不易或无法检测的攻击手段，对主机进行病毒传播和恶意破坏威胁。",
  
    "已修复": "已修复",
  
    "已忽略": "已忽略",
  
    "修复中": "修复中",
  
    "修复失败": "修复失败",
  
    "以下终端操作失败": "以下终端操作失败",
  
    "终端{0}": "终端{0}",
  
    "是否重启": "是否重启",
  
    "此操作仅对已选漏洞中未修复或修复失败的漏洞进行修复": "此操作仅对已选漏洞中未修复或修复失败的漏洞进行修复",
  
    "此操作仅对未修复或修复失败的漏洞补丁进行安装": "此操作仅对未修复或修复失败的漏洞补丁进行安装",
  
    "确定立即修复漏洞（KB:{0}）吗？": "确定立即修复漏洞（KB:{0}）吗？",
  
    "确定立即安装漏洞补丁（KB:{0}）进行修复吗？": "确定立即安装漏洞补丁（KB:{0}）进行修复吗？",
  
    "确定一键修复已选的{0}个漏洞吗？": "确定一键修复已选的{0}个漏洞吗？",
  
    "确定一键安装已选的{0}个漏洞补丁进行修复吗？": "确定一键安装已选的{0}个漏洞补丁进行修复吗？",
  
    "修复终端漏洞": "修复终端漏洞",
  
    "所选漏洞状态不能执行此操作": "所选漏洞状态不能执行此操作",
  
    "此操作对已选补丁中未修复或修复失败的进行安装": "此操作对已选补丁中未修复或修复失败的进行安装",
  
    "此操作仅对该漏洞还未修复或修复失败的终端进行修复": "此操作仅对该漏洞还未修复或修复失败的终端进行修复",
  
    "确定立即安装终端{0}({1})上的所有未修复漏洞补丁吗？": "确定立即安装终端{0}({1})上的所有未修复漏洞补丁吗？",
  
    "确定立即安装漏洞补丁（KB:{0}）吗？": "确定立即安装漏洞补丁（KB:{0}）吗？",
  
    "确定一键安装已选{0}个终端的所有未修复漏洞补丁吗？": "确定一键安装已选{0}个终端的所有未修复漏洞补丁吗？",
  
    "确定立即修复已选{0}个终端的漏洞（KB:{1}）吗？": "确定立即修复已选{0}个终端的漏洞（KB:{1}）吗？",
  
    "此漏洞修复后需要终端重启后才能生效": "此漏洞修复后需要终端重启后才能生效",
  
    "漏洞响应": "漏洞响应",
  
    "按终端处置": "按终端处置",
  
    "按漏洞处置": "按漏洞处置",
  
    "漏洞扫出时间": "漏洞扫出时间",
  
    "请输入终端名称或IP": "请输入终端名称或IP",
  
    "未修复终端": "未修复终端",
  
    "未修复高危漏洞": "未修复高危漏洞",
  
    "最近一次扫描": "最近一次扫描",
  
    "输入威胁文件的域名": "输入威胁文件的域名",
  
    "威胁等级：": "威胁等级：",
  
    "威胁类型：": "威胁类型：",
  
    "{{RISK_ANALYSIS}}查看": "{{RISK_ANALYSIS}}查看",
  
    "最近": "最近",
  
    "天-访问该域名有：": "天-访问该域名有：",
  
    "windows终端累计有": "windows终端累计有",
  
    "台；": "台；",
  
    "进程总数为": "进程总数为",
  
    "（当前仅支持windows终端的检测）": "（当前仅支持windows终端的检测）",
  
    "访问域名的终端": "访问域名的终端",
  
    "访问域名的进程": "访问域名的进程",
  
    "进程文件路径": "进程文件路径",
  
    "访问次数": "访问次数",
  
    "未处理文件": "未处理文件",
  
    "请输入威胁文件的域名": "请输入威胁文件的域名",
  
    "非在线终端不支持该操作": "非在线终端不支持该操作",
  
    "{0}文件": "{0}文件",
  
    "此操作仅对在线终端生效": "此操作仅对在线终端生效",
  
    "请输入正确的md5或域名": "请输入正确的md5或域名",
    "{{item.columnName}}": "{{item.columnName}}",
  
    "启用状态": "启用状态",
  
    "服务器地址IP域名": "服务器地址IP域名",
  
    "不允许添加重复的服务器地址IP或域名": "不允许添加重复的服务器地址IP或域名",
  
    "禁用?": "禁用?",
  
    "确定禁用所有补丁包下载服务器吗?": "确定禁用所有补丁包下载服务器吗?",
  
    " 同步windows策略": " 同步windows策略",
  
    "此项不继承父策略": "此项不继承父策略",
  
    "定期漏洞扫描": "定期漏洞扫描",
  
    "开启定期自动扫描": "开启定期自动扫描",
  
    "漏洞扫描结果": "漏洞扫描结果",
  
    "扫描完自动修复": "扫描完自动修复",
  
    "修复类型：": "修复类型：",
  
  
    "中危漏洞": "中危漏洞",
  
    "低危漏洞": "低危漏洞",
  
    "全部windows PC和服务器终端": "全部windows PC和服务器终端",
  
    "仅windows PC终端": "仅windows PC终端",
  
    "仅上报，不修复": "仅上报，不修复",
  
    "终端补丁包获取服务器地址设置": "终端补丁包获取服务器地址设置",
  
    "当终端无法从内置服务器获取补丁包时，允许管理平台主动下载补丁包缓存文件": "当终端无法从内置服务器获取补丁包时，允许管理平台主动下载补丁包缓存文件",

    "去设置": "去设置",
  
    "windows系统": "windows系统",
  
    "此版本暂不支持Linux漏洞修复的配置": "此版本暂不支持Linux漏洞修复的配置",
  
    "上下移动可调整终端补丁包获取地址的优先级顺序": "上下移动可调整终端补丁包获取地址的优先级顺序",
  
    "最多设置{0}个补丁包获取服务器": "最多设置{0}个补丁包获取服务器",
  
    "文件实时防护": "文件实时防护",
  
    "开启文件实时防护": "开启文件实时防护",
  
    "防护级别：": "防护级别：",
  
    "监控文件的所有操作方式，对电脑性能有一定影响": "监控文件的所有操作方式，对电脑性能有一定影响",
  
    "监控文件的执行、写入，确保病毒无法入侵及运行，极少影响电脑性能": "监控文件的执行、写入，确保病毒无法入侵及运行，极少影响电脑性能",
  
    "监控文件的执行，确保病毒无法运行，不影响电脑性能": "监控文件的执行，确保病毒无法运行，不影响电脑性能",
  
    "文件类型：": "文件类型：",
  
    "压缩文档": "压缩文档",
  
    "文件扫描：": "文件扫描：",
  
    "扫描引擎": "扫描引擎",
  
    "深信服SAVE人工智能引擎": "深信服SAVE人工智能引擎",
  
    "基因特征引擎": "基因特征引擎",
  
    "云查引擎": "云查引擎",
  
    "发现恶意文件：": "发现恶意文件：",
  
    "自动处置": "自动处置",
  
    "仅上报，不处置": "仅上报，不处置",
  
    "勒索病毒防护": "勒索病毒防护",
  
    "开启勒索诱饵防护": "开启勒索诱饵防护",
  
    "发现勒索行为：": "发现勒索行为：",
  
    "告警并手动处置": "告警并手动处置",
  
    "agent首次安装后触发扫描": "agent首次安装后触发扫描",
  
    "发现WebShell：": "发现WebShell：",
  
    "开启暴力破解检测": "开启暴力破解检测",
  
    "发现暴力破解：": "发现暴力破解：",
  
    "高级威胁防护": "高级威胁防护",
  
    "开启无文件攻击防护": "开启无文件攻击防护",
  
    "无文件攻击是指利用存在缺陷的应用程序，并将代码注入正常的系统进程（内存、注册表、windows powershell脚本、office文档），进而获得访问权，并在目标设备执行攻击命令的一种高级攻击手段": "无文件攻击是指利用存在缺陷的应用程序，并将代码注入正常的系统进程（内存、注册表、windows powershell脚本、office文档），进而获得访问权，并在目标设备执行攻击命令的一种高级攻击手段",
  
    "开启可疑powershell脚本执行检测": "开启可疑powershell脚本执行检测",
  
    "当前存在不少挖矿病毒和勒索病毒利用windows Powershell脚本以达到恶意代码不落地长期驻留在系统进行攻击，建议您开启此项防护": "当前存在不少挖矿病毒和勒索病毒利用windows Powershell脚本以达到恶意代码不落地长期驻留在系统进行攻击，建议您开启此项防护",
  
    "发现可疑powershell脚本执行": "发现可疑powershell脚本执行",
  
    "自动阻断脚本执行": "自动阻断脚本执行",
  
    "仅告警，不阻断": "仅告警，不阻断",
  
    "Linux系统": "Linux系统",
  
    "勒索诱饵防护是指在系统关键目录下投放诱饵文件，并实时监控诱饵文件是否存在被加密行为，据此判断主机是否中了勒索病毒，并立即进行事件处理": "勒索诱饵防护是指在系统关键目录下投放诱饵文件，并实时监控诱饵文件是否存在被加密行为，据此判断主机是否中了勒索病毒，并立即进行事件处理",
  
    "仅在首次安装agent后扫描一次": "仅在首次安装agent后扫描一次",
  
    "支持的类型有：7z, XZ, BZIP2, GZIP, TAR, ZIP, WIM, ARJ, CAB, CHM, CPIO, CramFS, DEB, DMG, ISO, LZH, MSI, RAR, RPM, SquashFS, XAR, Z 共22种": "支持的类型有：7z, XZ, BZIP2, GZIP, TAR, ZIP, WIM, ARJ, CAB, CHM, CPIO, CramFS, DEB, DMG, ISO, LZH, MSI, RAR, RPM, SquashFS, XAR, Z 共22种",
  
    "点击允许客户端设置，策略以客户端的为准": "点击允许客户端设置，策略以客户端的为准",
  
    "点击禁止客户端设置，策略以管理平台的为准": "点击禁止客户端设置，策略以管理平台的为准",
  
    "定时查杀时间": "定时查杀时间",
  
    "扫描类型": "扫描类型",
  
    "查杀扫描": "查杀扫描",
  
    "扫描文件：": "扫描文件：",
  
    "发现威胁文件：": "发现威胁文件：",
  
    "行为分析引擎": "行为分析引擎",
  
    "终端病毒库升级": "终端病毒库升级",
  
    "ip: http://200.200.0.1或https://200.200.0.1  ": "ip: http://200.200.0.1或https://200.200.0.1  ",
  
    "域名: http://sangfor.com或https://sangfor.com  ": "域名: http://sangfor.com或https://sangfor.com  ",
  
    "最多添加{0}个新任务": "最多添加{0}个新任务",
  
    "最多设置{0}个升级服务器": "最多设置{0}个升级服务器",
  
    "此策略为旧版本配置的策略，仅针对此分组部分终端生效。生效终端有：{0}": "此策略为旧版本配置的策略，仅针对此分组部分终端生效。生效终端有：{0}",
  
    "最多配置5项扫描计划": "最多配置5项扫描计划",
  
    "相同时间点不允许配置多个计划": "相同时间点不允许配置多个计划",
  
    "终端资产信息登记": "终端资产信息登记",
  
    "开启终端资产信息登记": "开启终端资产信息登记",
  
    "终端防护中心密码保护设置": "终端防护中心密码保护设置",
  
    "开启终端“防退出”密码保护": "开启终端“防退出”密码保护",
  
    "开启终端“防卸载”密码保护": "开启终端“防卸载”密码保护",
  
    "此版本暂不支持Linux基本策略的配置": "此版本暂不支持Linux基本策略的配置",
  
    "信任名单": "信任名单",
  
    "文件/目录白名单": "文件/目录白名单",
  
    "（结尾无\"\\\"表示文件，有\"\\\"表示目录路径）": "（结尾无\"\\\"表示文件，有\"\\\"表示目录路径）",
  
    "文件/目录": "文件/目录",
  
    "文件": "文件",
  
    "目录路径": "目录路径",
  
    "此版本暂不支持Linux信任名单的配置": "此版本暂不支持Linux信任名单的配置",
  
    "加入白名单的文件、目录等在病毒扫描和实时监控时将被自动跳过": "加入白名单的文件、目录等在病毒扫描和实时监控时将被自动跳过",
  
    "路径已存在": "路径已存在",
  
    "删除白名单": "删除白名单",
  
    "确定要删除该白名单：{0}吗？": "确定要删除该白名单：{0}吗？",
  
    "恢复默认策略": "恢复默认策略",
  
    "一键继承": "一键继承",
  
    "全部恢复继承": "全部恢复继承",
  
    "本组{0}策略完全继承父策略": "本组{0}策略完全继承父策略",
  
    "本组{0}策略不完全继承父策略": "本组{0}策略不完全继承父策略",
  
    "该分组下的所有终端均未授权": "该分组下的所有终端均未授权",
  
    "一键继承策略": "一键继承策略",
  
    "确定要将本组策略继承给它的全部下级子分组吗？": "确定要将本组策略继承给它的全部下级子分组吗？",
  
    "除了云查引擎，扫描引擎还必须选中一个": "除了云查引擎，扫描引擎还必须选中一个",
  
    "确定要将本组{0}策略恢复为平台默认策略吗？": "确定要将本组{0}策略恢复为平台默认策略吗？"
  }